---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.Finish
source: html/68714169-e994-41e3-f1c6-8f929b40565f.htm
---
# Autodesk.Revit.DB.IExportContext.Finish Method

This method is called at the very end of the export process,
 after all entities were processed (or after the process was cancelled).

## Syntax (C#)
```csharp
void Finish()
```